OpenFOAMObject/meshParticle/tgaSolver/tutorial/CRECK2018/constant/reactionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// cellulose
//CELL=>CELLA
reaction0
{
  reactants CELL;

  solidProducts
  (
    (CELLA 1)
  );

  gasProducts
  (
    (Null 0)
  );

  Ea  47000.00;
  A 1.50000E+014;
  b 0;

};

//CELLA=> 0.05*CH2OHCH2CHO + 0.4*CH2OHCHO
// " 0.03*CHOCHO + 0.17*CH3CHO + 0.25*C6H6O3 + 0.35*C2H5CHO
// " 0.2*CH3OH + 0.15*CH2O + 0.49*CO + 0.43*CO2 + 0.13*H2
// " 0.93*H2O + 0.02*HCOOH + 0.05*CH4
//+ 0.66*CHAR + 0.05*G_CO + 0.05*G_COH2_L + 0.1*G_H2"
reaction1
{
  reactants CELLA;

  solidProducts
  (
      (C 0.66)
      (GCO 0.05)
      (GCOH2L 0.05)
      (GH2 0.1)
  );

  gasProducts
  (
      (CH2OHCH2CHO 0.05)
      (CH2OHCHO 0.4)
      (CHOCHO 0.03)
      (CH3CHO 0.17)
      (C6H6O3 0.25)
      (C2H5CHO 0.35)
      (CH3OH 0.2)
      (CH2O 0.15)
      (CO 0.49)
      (CO2 0.43)
      (H2 0.13)
      (H2O 0.93)
      (HCOOH 0.02)
      (CH4 0.05)
  );

    Ea  19100.00;
    A 2.5000E+006;
    b 0;
};

//CELLA=>C6H10O5
reaction2
{
  reactants CELLA;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (C6H10O5 1)
  );

    Ea  10000.00;
    A 3.3000E+00;
    b 1;

};

//CELL=>0.125*H2 + 4.45*H2O + 5.45*CHAR +
//      0.12*G_COH2_S + 0.25*G_CO + 0.18*G_COH2_L + 0.125*G_H2"
reaction3
{
  reactants CELL;

  solidProducts
  (
      (C 5.45)
      (GCOH2S 0.12)
      (GCO 0.25)
      (GCOH2L 0.18)
      (GH2 0.125)
  );

  gasProducts
  (
      (H2 0.125)
      (H2O 4.45)
  );

    Ea  31000.00;
    A 9.0000E+007;
    b 0;

};

//GMSW_C5H8O4 --> 0.7*HCE1_C5H8O4 + 0.3*HCE2_C5H8O4
reaction4
{
  reactants GMSW;//C5H8O4

  solidProducts
  (
      (HCE1 0.7)
      (HCE2 0.3)
  );

  gasProducts
  (
      (Null 0)
  );

    Ea  31000.00;
    A 1.0000E+010;
    b 0;

};

//XYHW_C5H8O4 --> 0.35*HCE1_C5H8O4 + 0.65*HCE2_C5H8O4
reaction5
{
  reactants XYHW;//C5H8O4

  solidProducts
  (
      (HCE1 0.35)
      (HCE2 0.65)
  );

  gasProducts
  (
      (Null 0)
  );

    Ea  31400.00;
    A 1.2500E+011;
    b 0;

};

//XYGR_C5H8O4 --> 0.12*HCE1_C5H8O4 + 0.88*HCE2_C5H8O4
reaction6
{
  reactants XYGR;//C5H8O4

  solidProducts
  (
      (HCE1 0.12)
      (HCE2 0.88)
  );

  gasProducts
  (
      (Null 0)
  );

    Ea  30000.00;
    A 1.2500E+011;
    b 0;

};

//HCE1=>HCE1_C5H8O4 --> 0.06*CH2OHCH2CHO + 0.16*FURFURAL_C5H4O2 +
//         0.1*CHOCHO + 0.13*C6H6O3 + 0.09*CO2 + 0.02*H2 + 0.54*H2O +
//         0.25*C6H10O5 + 0.1*CH4 + 0.25*C5H8O4 +
//         0.1*CHAR
reaction7
{
  reactants HCE1;

  solidProducts
  (
      (C 0.1)
  );

  gasProducts
  (
      (CH2OHCH2CHO 0.06)
      (FURFURAL 0.16)
      (CHOCHO 0.1)
      (C6H6O3 0.13)
      (CO2 0.09)
      (H2 0.02)
      (H2O 0.54)
      (C6H10O5 0.25)
      (CH4 0.1)
      (C5H8O4 0.25)
  );

    Ea  12900.00;
    A 1.6000E+001;
    b 1;

};

//HCE1=>HCE1_C5H8O4 --> 0.4*CH2O + 0.49*CO + 0.39*CO2 + 0.1*H2 +" &
//        " 0.4*H2O + 0.05*HCOOH + 0.1*C2H4 + 0.3*CH4 + 0.975*CHAR +"&
//        " 0.37*G_COH2_S + 0.51*G_CO2 + 0.01*G_CO + 0.325*G_CH4 +"&
//        " 0.075*G_C2H4 + 0.43*G_COH2_L + 0.05*G_H2 + 0.2*G_C2H6
reaction8
{
  reactants HCE1;

  solidProducts
  (
      (C 0.975)
      (GCOH2S 0.37)
      (GCO2 0.51)
      (GCO 0.01)
      (GCH4 0.325)
      (GC2H4 0.075)
      (GCOH2L 0.43)
      (GH2 0.05)
      (GC2H6 0.2)
  );

  gasProducts
  (
      (CH2O 0.4)
      (CO 0.49)
      (CO2 0.39)
      (H2 0.1)
      (H2O 0.4)
      (HCOOH 0.05)
      (C2H4 0.1)
      (CH4 0.3)
  );

    Ea  3600.00;
    A 3.0000E-003;
    b 1;

};

//HCE2=>HCE2_C5H8O4 --> 0.145*FURFURAL_C5H4O2 + 0.105*CH3CO2H +" &
//        " 0.035*CH2OHCHO + 0.3*CO + 0.5125*CO2 + 0.5505*H2 +"&
//        " 0.056*H2O + 0.0175*HCOOH + 0.049*C2H5OH + 0.1895*CH4 +"&
//        " 0.7125*CHAR + 0.78*G_COH2_S + 0.45*G_CO2 + 0.105*G_CH3OH +"&
//        " 0.05*G_CH4 + 0.1*G_C2H4 + 0.18*G_COH2_L + 0.21*G_H2 +"&
//        " 0.2*G_C2H6
reaction9
{
  reactants HCE2;

  solidProducts
  (
      (C 0.7125)
      (GCOH2S 0.78)
      (GCO2 0.45)
      (GCH3OH 0.105)
      (GCH4 0.05)
      (GC2H4 0.1)
      (GCOH2L 0.18)
      (GH2 0.21)
      (GC2H6 0.2)
  );

  gasProducts
  (
      (FURFURAL 0.145)
      (CH3CO2H 0.105)
      (CH2OHCHO 0.035)
      (CO 0.3)
      (CO2 0.5125)
      (H2 0.5505)
      (H2O 0.056)
      (HCOOH 0.0175)
      (C2H5OH 0.049)
      (CH4 0.1895)
  );

    Ea  30500.00;
    A 7.0000E+009;
    b 0;

};

//LIGH_C22H28O9 --> 0.2*CH2OHCHO + 0.5*C2H5CHO + 0.1*CO +" &
//        " 0.4*C2H4 + 0.1*C2H6 + LIGOH_C19H22O8
reaction10
{
  reactants LIG-H;

  solidProducts
  (
      (LIG-OH 1)
  );

  gasProducts
  (
      (CH2OHCHO 0.2)
      (C2H5CHO 0.5)
      (CO 0.1)
      (C2H4 0.4)
      (C2H6 0.1)
  );

    Ea  37500.00;
    A 6.7000E+012;
    b 0;

};

//LIGO_C20H22O10 --> CO2 + LIGOH_C19H22O8
reaction11
{
  reactants LIG-O;

  solidProducts
  (
      (LIG-OH 1)
  );

  gasProducts
  (
      (CO2 1)
  );

    Ea  25500.00;
    A 3.3000E+008;
    b 0;

};

//LIGC=>LIGC_C15H14O4 --> 0.1*C6H5OCH3 + 0.22*CH2O + 0.21*CO +" &
//        " 0.1*CO2 + H2O + 0.27*C2H4 + 0.1*VANILLIN_C8H8O3 +"&
//        " 0.35*LIGCC_C15H14O4 + 5.85*CHAR + 0.4*G_COH2_S + 0.36*G_CH4"&
//        " + 0.17*G_COH2_L + 0.1*G_H2 + 0.2*G_C2H6
reaction12
{
  reactants LIG-C;

  solidProducts
  (
      (LIG-CC 0.35)
      (C 5.85)
      (GCOH2S 0.4)
      (GCH4 0.36)
      (GCOH2L 0.17)
      (GH2 0.1)
      (GC2H6 0.2)
  );

  gasProducts
  (
      (C6H5OCH3 0.1)
      (CH2O 0.22)
      (CO 0.21)
      (CO2 0.1)
      (H2O 1.0)
      (C2H4 0.27)
      (VANILLIN 0.1)
  );

    Ea  37200.00;
    A 1.0000E+011;
    b 0;

};

// //LIGCC_C15H14O4 --> 0.15*C6H5OCH3 + 0.35*CH2OHCHO + 1.15*CO +" &
//         " 0.7*H2 + 0.7*H2O + 0.3*C2H4 + 0.45*CH4 +"&
//         " 0.25*VANILLIN_C8H8O3 + 0.15*CRESOL_C7H8O + 0.4*C2H6 +"&
//         " 6.8*CHAR + 0.4*G_CO
reaction13
{
  reactants LIG-CC;

  solidProducts
  (
      (C 6.8)
      (GCO 0.4)
  );

  gasProducts
  (
      (C6H5OCH3 0.15)
      (CH2OHCHO 0.35)
      (CO 1.15)
      (H2 0.7)
      (H2O 0.7)
      (C2H4 0.3)
      (CH4 0.45)
      (VANILLIN 0.25)
      (CRESOL 0.15)
      (C2H6 0.4)
  );

    Ea  24800.00;
    A 1.0000E+004;
    b 0;

};

//LIGOH_C19H22O8 --> 0.025*C24H28O4 + 0.1*C2H3CHO + 0.6*CH3OH" &
        // " + 0.65*CO + 0.05*CO2 + H2O + 0.05*HCOOH + 0.1*CH4 +"&
        // " 0.9*LIG_C11H12O4 + 4.25*CHAR + 0.4*G_COH2_S + 0.6*G_CO +"&
        // " 0.3*G_CH3OH + 0.25*G_CH4 + 0.1*G_C2H4 + 0.45*G_COH2_L +"&
        // " 0.15*G_C2H6
reaction14
{
  reactants LIG-OH;

  solidProducts
  (
      (LIG 0.9)
      (C 4.25)
      (GCOH2S 0.4)
      (GCO 0.6)
      (GCH3OH 0.3)
      (GCH4 0.25)
      (GC2H4 0.1)
      (GCOH2L 0.45)
      (GC2H6 0.15)
  );

  gasProducts
  (
      (C24H28O4 0.025)
      (C2H3CHO 0.1)
      (CH3OH 0.6)
      (CO 0.65)
      (CO2 0.05)
      (H2O 1.0)
      (HCOOH 0.05)
      (CH4 0.1)
  );

    Ea  30000.00;
    A 1.5000E+008;
    b 0;

};

//LIG_C11H12O4 --> 0.1*C6H5OCH3 + 0.3*CH3CHO + 0.6*CO +" &
        // " 0.5*C2H4 + VANILLIN_C8H8O3 + 0.1*CHAR
reaction15
{
  reactants LIG;

  solidProducts
  (
      (C 0.1)
  );

  gasProducts
  (
      (C6H5OCH3 0.1)
      (CH3CHO 0.3)
      (CO 0.6)
      (C2H4 0.5)
      (VANILLIN 1)
  );

    Ea  12000.00;
    A 4.000E+000;
    b 1;

};

//LIG_C11H12O4 --> 0.4*CH2O + 0.3*CO + 0.1*CO2 + 0.6*H2O + 0.2*CH4 
        // + 6.1*CHAR + 0.65*G_COH2_S + 0.2*G_CO + 0.4*G_CH3OH"&
        // " + 0.4*G_CH4 + 0.5*G_C2H4 + 1.25*G_COH2_L + 0.1*G_H2
reaction16
{
  reactants LIG;

  solidProducts
  (
      (C 6.1)
      (GCOH2S 0.65)
      (GCO 0.2)
      (GCH3OH 0.4)
      (GCH4 0.4)
      (GC2H4 0.5)
      (GCOH2L 1.25)
      (GH2 0.1)
  );

  gasProducts
  (
      (CH2O 0.4)
      (CO 0.3)
      (CO2 0.1)
      (H2O 0.6)
      (CH4 0.2)
  );

    Ea  8000.00;
    A 8.3000E-002;//
    b 1;

};

// LIG_C11H12O4 --> 0.4*CH3OH + 0.4*CH2O + 2.6*CO + 0.6*H2O +" &
//         " 0.75*C2H4 + 0.6*CH4 + 0.5*C2H6 + 4.5*CHAR
reaction17
{
  reactants LIG;

  solidProducts
  (
      (C 4.5)
  );

  gasProducts
  (
      (CH3OH 0.4)
      (CH2O 0.4)
      (CO 2.6)
      (H2O 0.6)
      (C2H4 0.75)
      (CH4 0.6)
      (C2H6 0.5)
  );

    Ea  31500.00;
    A 1.5000E+009;
    b 0;
};



//TGL_C57H10O7 --> C2H3CHO + 0.5*U2ME12_C13H22O2 +" &
//        " 2.5*MLINO_C19H34O2
reaction18
{
  reactants TGL;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (C2H3CHO 1)// ACROLEIN // C2H3CHO
      (U2ME12 0.5)// U2ME12 //C13H22O2
      (MLINO 2.5)// MLINO //C19H34O2
  );

    Ea  45700.00;
    A 7.0000E+012;
    b 0;
};

//TANN_C15H12O7 --> H2O + 0.85*C6H5OH + ITANN_C8H4O4 + G_CO +" &
//        " 0.15*G_C6H5OH
reaction19
{
  reactants TANN;

  solidProducts
  (
      (ITANN 1.0)
      (GCO 1.0)
      (GC6H5OH 0.15)
  );

  gasProducts
  (
      (H2O 1.0)
      (C6H5OH 0.85)// C6H5OH PHENOL
  );

    Ea  10000.00;
    A 2.0000E+001;
    b 0;
};

//ITANN_C8H4O4 --> 2*CO + H2O + 5*CHAR + 0.45*G_COH2_S +" &
//        " 0.55*G_COH2_L
reaction20
{
  reactants ITANN;

  solidProducts
  (
      (C 5.0)
      (GCOH2S 0.45)
      (GCOH2L 0.55)
  );

  gasProducts
  (
      (CO 2.0)
      (H2O 1.0)
  );

    Ea  25000.00;
    A 1.0000E+003;
    b 0;
};

//G(CO2)=>CO2
reaction21
{
  reactants GCO2;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (CO2 1)
  );

    Ea  24500.00;
    A 1.0000E+006;
    b 0;
};

//G(CO)=>CO
reaction22
{
  reactants GCO;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (CO 1)
  );

    Ea  52500.00;
    A 5.0000E+012;
    b 0;
};

//G(CH3OH)=>CH3OH
reaction23
{
  reactants GCH3OH;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (CH3OH 1)
  );

    Ea 50000.00;
    A 2.0000E+012;
    b 0;
};

//G_COH2_L --> 0.2*CO + 0.2*H2 + 0.8*H2O + 0.8*CHAR
reaction24
{
  reactants GCOH2L;

  solidProducts
  (
      (C 0.8)
  );

  gasProducts
  (
      (CO 0.2)
      (H2 0.2)
      (H2O 0.8)
  );

    Ea  50000.00;
    A 6.0000E+010;
    b 0;
};

//G_C2H6 --> C2H6
reaction25
{
  reactants GC2H6;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (C2H6 1)
  );

    Ea  52000.00;
    A 1.0000E+011;
    b 0;
};

//G(CH4)=>CH4
reaction26
{
  reactants GCH4;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (CH4 1)
  );

    Ea  53000.00;
    A 1.0000E+011;
    b 0;
};

//G(C2H4)=>C2H4
reaction27
{
  reactants GC2H4;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (C2H4 1)
  );

    Ea  54000.00;
    A 1.0000E+011;
    b 0;
};

//G_C6H5OH --> C6H5OH
reaction28
{
  reactants GC6H5OH;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (C6H5OH 1)
  );

    Ea  55000.00;
    A 1.5000E+012;
    b 0;
};

//G_COH2_S --> 0.8*CO + 0.8*H2 + 0.2*H2O + 0.2*CHAR
reaction29
{
  reactants GCOH2S;

  solidProducts
  (
      (C 0.2)
  );

  gasProducts
  (
      (CO 0.8)
      (H2 0.8)
      (H2O 0.2)
  );

    Ea  59000.00;
    A 1.0000E+009;
    b 0;
};

//G(H2)=>H2
reaction30
{
  reactants GH2;

  solidProducts
  (
      (Null 0)
  );

  gasProducts
  (
      (H2 1)
  );

    Ea  70000.00;
    A 1.0000E+008;
    b 0;
};







// ************************************************************************* //
